/**
 * +----------------------------------------------------------------------
 * | name: lottery
 * +----------------------------------------------------------------------
 * | Copyright (c) 2019
 * +----------------------------------------------------------------------
 * | Author: cohen_wang <615940742@qq.com>
 * +----------------------------------------------------------------------
 */


// +----------------------------------------------------------------------
// | 名单列表
// +----------------------------------------------------------------------
const USER_LIST = [
    '罗可成',
    '赵星',
    '吴俊',
    '王海涛',
    '张强',
];


// +----------------------------------------------------------------------
// | 名单列表
// +----------------------------------------------------------------------
const RESOURCE_CONFIG = {
    image: [
        {
            name: 'tiefan',
            url: './res/image/tiefan.png',
        },
    ],
    audio: [
        {
            name: 'open-show',
            url: './res/audio/open-show.mp3',
        }
    ],
};

// +----------------------------------------------------------------------
// | 标题
// +----------------------------------------------------------------------
const TITLE_CONFIG = {
    // 是否显示
    // boolean
    isShow: true,
    // 实心字体: true 或 空心字体: false
    // boolean
    isSolid: false,
    // 内容
    // string
    text: '铁帆游戏大转盘',
    // 颜色
    // string
    color: '#3b3a38',
    // 大小
    // number
    fontSize: 80,
};


// +----------------------------------------------------------------------
// | 背景动画
// +----------------------------------------------------------------------
/**
 * 实心圆
 */
const SOLID_CIRCLE_CONFIG = {
    num: 4,// 个数
    create_probability: 0.3,// 初始化速度概率
};

/**
 * 空心圆
 */
const HOLLOW_CIRCLE_CONFIG = {
    num: 6,// 个数
    create_probability: 0.3,// 初始化速度概率
};

/**
 * 实心星星
 */
const SOLID_STAR_CONFIG = {
    num: 4,// 个数
    create_probability: 0.3,// 初始化速度概率
};

/**
 * 空心星星
 */
const HOLLOW_STAR_CONFIG = {
    num: 6,// 个数
    create_probability: 0.3,// 初始化速度概率
};


/**
 * 实心文字
 */
const SOLID_TEXT_CONFIG = {
    num: 20,// 个数
    create_probability: 0.8,// 初始化速度概率
};

/**
 * 空心文字
 */
const HOLLOW_TEXT_CONFIG = {
    num: 20,// 个数
    create_probability: 0.8,// 初始化速度概率
};